app/controllers/posts_controller.rb

INSERT INTO `posts` (`contents`, `created_at`, `updated_at`, `rooms_id`, `latitude`, `longitude`, `image`) VALUES ('aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2018-05-20 03:28:06', '2018-05-20 03:28:06', 6, 35.727188999999996, 139.76817610000003, 'null')
---
def create
  #300文字以上なら処理せずにトップページへリダイレクト
  if params[:content].length > 300 then
    redirect_to("/rooms/" + params[:roomId])
  end
  #roomIDをセット。DBから抽出。
  @roomId = params[:roomId]
  @room = Timeline.find_by(id: @roomId)

  @startLat = @room.latitude.to_f - 0.00138889
  @endLat = @room.latitude.to_f + 0.00138889
  @startLng = @room.longitude.to_f - 0.00138889
  @endLng = @room.longitude.to_f + 0.00138889
  @userLat = params[:latitude].to_f
  @userLng = params[:longitude].to_f

  unless params[:content].include?('>>') then
    similarity(params[:content])
  end
  if @startLat < @userLat && @userLat < @endLat && @startLng < @userLng && @userLng  < @endLng || @roomId == "0" || @roomId == Rails.cache.read('lock_room') then
    unless params[:content].empty? && params[:image].empty? then
      if params[:image].present? then
        @image = params[:image]
        imgur()
      end
      post = Post.new(content:params[:content], room:params[:roomId], image:@image_link, similarity: @mostSimId, simvalue: @mostSimvValue, latitude: params[:latitude], longitude: params[:longitude])
      post.save