app/controllers/soco_posts_controller.rb

INSERT INTO `soco_posts` (`contents`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES ('成功想定です', 1.5, 1.5, '2018-06-22 13:54:45', '2018-06-22 13:54:45')
---
  def create
    @posts = SocoPost.new(soco_posts_params)
    @posts[:latitude] = @latitude
    @posts[:longitude] = @longitude
    tags = params[:soco_post][:tag]
    reply_id = params[:soco_post][:reply]

    if tags.present?
      tags.split(',').each do |tag|
        @posts.tag_list.add(tag)
      end
    end

    if @posts.save

UPDATE `soco_posts` SET `good` = 1 WHERE `soco_posts`.`id` = 1
---
  def favorite
    posts_id = params[:soco_post][:id]
    @posts = SocoPost.find(posts_id) # いいねを更新する投稿先情報を取得
    soco_params = soco_posts_params # 更新用のガワを用意する
    soco_params[:good] = soco_params[:good].to_i + 1 # いいねを1増やす

    if accept_favorite(posts_id)
      @posts.record_timestamps = false
      if @posts.update(soco_params)