app/controllers/soco_posts_controller.rb

SELECT `tags`.* FROM `tags` WHERE (LOWER(name) = LOWER('明星大学') OR LOWER(name) = LOWER('中央大学'))
INSERT INTO `soco_posts` (`contents`, `reply`, `latitude`, `longitude`, `image`, `created_at`, `updated_at`) VALUES ('返信します', 76, 35.7272545, 139.7683467, 'null', '2018-06-07 13:32:58', '2018-06-07 13:32:58')
INSERT INTO `tags` (`name`) VALUES ('中央大学')
---
  def create
    @posts = SocoPost.new(soco_posts_params)
    @posts[:latitude] = @latitude
    @posts[:longitude] = @longitude
    tags = params[:soco_post][:tag]
    reply_id = params[:soco_post][:reply]

    if tags.present?
      tags.split(',').each do |tag|
        @posts.tag_list.add(tag)
      end
    end

    if @posts.save

SELECT  `soco_posts`.* FROM `soco_posts` WHERE `soco_posts`.`id` = 19 LIMIT 1
UPDATE `soco_posts` SET `good` = 1, `updated_at` = '2018-06-02 09:47:24' WHERE `soco_posts`.`id` = 19
---
  def favorite
    posts_id = params[:soco_post][:id]
    @posts = SocoPost.find(posts_id) # いいねを更新する投稿先情報を取得
    soco_params = soco_posts_params # 更新用のガワを用意する
    soco_params[:good] = soco_params[:good].to_i + 1 # いいねを1増やす

    if accept_favorite(posts_id)
      @posts.record_timestamps = false
      if @posts.update(soco_params)