app/views/soco_posts/_post.json.jbuilder

INSERT INTO `soco_posts` (`contents`, `reply`, `latitude`, `longitude`, `image`, `created_at`, `updated_at`) VALUES ('投稿', 84, 35.641927, 139.408568, '', '2018-06-07 15:36:51', '2018-06-07 15:36:51')
---
end
json.created_at post.created_at