app/views/soco_posts/_post.json.jbuilder

INSERT INTO `soco_posts` (`contents`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES ('成功想定です', 1.5, 1.5, '2018-06-22 14:29:36', '2018-06-22 14:29:36')
---
end
json.created_at post.created_at